In [1]:
import pandas as pd

In [2]:
titanic = pd.read_csv("titanic.csv")

In [3]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Faça o resumo estatístico por gênero (coluna Sex), contendo a média de idade, o número de sobreviventes e o número de vítimas. (Utilize groupby)

In [ ]:
quadro_etario = titanic.groupby("Faixa_Etaria")["Faixa_Etaria"].count().to_frame(name="Quantidade")
quadro_etario['Porcentagem'] = round((quadro_etario['Quantidade'] / quadro_etario['Quantidade'].sum()) * 100,2)
print(quadro_etario)

new= titanic.groupby("Sex")["Age"].mean().to_frame(name="Media_Idade")

vivos = titanic[titanic["Survived"]==1].groupby("Sex")["Survived"].count()
mortos = titanic[titanic["Survived"]==0].groupby("Sex")["Survived"].count()

new["Vivos"]= vivos
new["Mortos"]= mortos
print(new)

In [25]:
new= titanic.groupby("Sex")["Age"].mean().to_frame(name="Media_Idade")

new["vivos"] = titanic[titanic["Survived"]==1].groupby("Sex")["Survived"].count()
new["mortos"] = titanic[titanic["Survived"]==0].groupby("Sex")["Survived"].count()

print(new)

        Media_Idade  vivos  mortos
Sex
female    27.915709    233      81
male      30.726645    109     468